REPLACE INTO `creature_template` (`entry`, `difficulty_entry_1`, `difficulty_entry_2`, `difficulty_entry_3`, `difficulty_entry_4`, `difficulty_entry_5`, `difficulty_entry_6`, `difficulty_entry_7`, `difficulty_entry_8`, `difficulty_entry_9`, `difficulty_entry_10`, `difficulty_entry_11`, `difficulty_entry_12`, `difficulty_entry_13`, `difficulty_entry_14`, `difficulty_entry_15`, `KillCredit1`, `KillCredit2`, `modelid1`, `modelid2`, `modelid3`, `modelid4`, `name`, `subname`, `IconName`, `gossip_menu_id`, `minlevel`, `maxlevel`, `exp`, `exp_unk`, `faction_A`, `faction_H`, `npcflag`, `npcflag2`, `speed_walk`, `speed_run`, `speed_fly`, `scale`, `rank`, `mindmg`, `maxdmg`, `dmgschool`, `attackpower`, `dmg_multiplier`, `baseattacktime`, `rangeattacktime`, `unit_class`, `unit_flags`, `unit_flags2`, `dynamicflags`, `family`, `trainer_type`, `trainer_spell`, `trainer_class`, `trainer_race`, `minrangedmg`, `maxrangedmg`, `rangedattackpower`, `type`, `type_flags`, `type_flags2`, `lootid`, `pickpocketloot`, `skinloot`, `resistance1`, `resistance2`, `resistance3`, `resistance4`, `resistance5`, `resistance6`, `spell1`, `spell2`, `spell3`, `spell4`, `spell5`, `spell6`, `spell7`, `spell8`, `PetSpellDataId`, `VehicleId`, `mingold`, `maxgold`, `AIName`, `MovementType`, `InhabitType`, `HoverHeight`, `Health_mod`, `Mana_mod`, `Mana_mod_extra`, `Armor_mod`, `RacialLeader`, `questItem1`, `questItem2`, `questItem3`, `questItem4`, `questItem5`, `questItem6`, `movementId`, `RegenHealth`, `equipment_id`, `mechanic_immune_mask`, `flags_extra`, `ScriptName`, `WDBVerified`) VALUES 
(68078, 0, 0, 0, 680784, 680785, 680786, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46627, 0, 0, 0, 'Iron Qon', 'Master of Quilen', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 3, 43563, 69309, 0, 51299, 8, 2000, 2000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2097260, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3246199, 3246199, '', 0, 3, 1, 238, 100, 1, 1, 0, 0, 0, 0, 0, 0, 0, 150, 1, 0, 0, 0, '', 17614),
(680784, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46627, 0, 0, 0, 'Iron Qon', 'Master of Quilen', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 3, 43563, 69309, 0, 51299, 8, 2000, 2000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2097260, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3246199, 3246199, '', 0, 3, 1, 714, 100, 1, 1, 0, 0, 0, 0, 0, 0, 0, 150, 1, 0, 0, 0, '', 17614),
(680785, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46627, 0, 0, 0, 'Iron Qon', 'Master of Quilen', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 3, 43563, 69309, 0, 51299, 10, 2000, 2000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2097260, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3246199, 3246199, '', 0, 3, 1, 357, 100, 1, 1, 0, 0, 0, 0, 0, 0, 0, 150, 1, 0, 0, 0, '', 17614),
(680786, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46627, 0, 0, 0, 'Iron Qon', 'Master of Quilen', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 3, 43563, 69309, 0, 51299, 10, 2000, 2000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2097260, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3246199, 3246199, '', 0, 3, 1, 1071, 100, 1, 1, 0, 0, 0, 0, 0, 0, 0, 150, 1, 0, 0, 0, '', 17614),

(68079, 0, 0, 0, 680794, 680795, 680796, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46628, 0, 0, 0, 'Ro\'shak', 'The Molten Flare', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2707, 0, 0, '', 0, 3, 1, 250, 0.01, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680794, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46628, 0, 0, 0, 'Ro\'shak', 'The Molten Flare', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2707, 0, 0, '', 0, 3, 1, 750, 0.01, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680795, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46628, 0, 0, 0, 'Ro\'shak', 'The Molten Flare', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2707, 0, 0, '', 0, 3, 1, 375, 0.01, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680796, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46628, 0, 0, 0, 'Ro\'shak', 'The Molten Flare', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2707, 0, 0, '', 0, 3, 1, 1125, 0.01, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),

(68080, 0, 0, 0, 680804, 680805, 680806, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46629, 0, 0, 0, 'Quet\'zal', 'The Stormcaller', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2704, 0, 0, '', 0, 3, 1, 230, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680804, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46629, 0, 0, 0, 'Quet\'zal', 'The Stormcaller', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2704, 0, 0, '', 0, 3, 1, 690, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680805, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46629, 0, 0, 0, 'Quet\'zal', 'The Stormcaller', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2704, 0, 0, '', 0, 3, 1, 345, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680806, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46629, 0, 0, 0, 'Quet\'zal', 'The Stormcaller', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2704, 0, 0, '', 0, 3, 1, 1035, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),

(68081, 0, 0, 0, 680814, 680815, 680816, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46630, 0, 0, 0, 'Dam\'ren', 'The Frozen Sage', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2705, 0, 0, '', 0, 3, 1, 184, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680814, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46630, 0, 0, 0, 'Dam\'ren', 'The Frozen Sage', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 8, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2705, 0, 0, '', 0, 3, 1, 552, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680815, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46630, 0, 0, 0, 'Dam\'ren', 'The Frozen Sage', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2705, 0, 0, '', 0, 3, 1, 276, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),
(680816, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46630, 0, 0, 0, 'Dam\'ren', 'The Frozen Sage', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 1, 43563, 69309, 0, 45299, 10, 2000, 2000, 1, 0, 0, 0, 128, 0, 0, 0, 0, 0, 0, 0, 1, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2705, 0, 0, '', 0, 3, 1, 828, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 183, 1, 0, 0, 0, '', 17614),

(68480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11686, 0, 0, 0, 'Iron Qon\'s Spear', '', '', 0, 93, 93, 4, 0, 14, 14, 0, 0, 1, 1.14286, 1.14286, 1, 0, 9839, 14339, 0, 42299, 1, 2000, 2000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 1048576, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 1, 1.35, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, '', 17614);


UPDATE `creature_template` SET `ScriptName`='boss_iron_qon' WHERE `entry`=68078;
UPDATE `creature_template` SET `ScriptName`='npc_iron_qon_roshak' WHERE `entry`=68079;
UPDATE `creature_template` SET `ScriptName`='npc_iron_qon_quetzal' WHERE `entry`=68080;
UPDATE `creature_template` SET `ScriptName`='npc_iron_qon_damren' WHERE `entry`=68081;
UPDATE `creature_template` SET `ScriptName`='npc_iron_qon_spear' WHERE `entry`=68480;


DELETE FROM `spell_script_names` WHERE `spell_id` IN
(137712, 134664, 136330);
INSERT INTO `spell_script_names` (`spell_id`, `ScriptName`) VALUES 
(137712, 'spell_iron_qon_return_spear_script'),
(134664, 'spell_iron_qon_molten_inferno'),
(136330, 'spell_iron_qon_burning_cinders_aoe');

DELETE FROM `conditions` WHERE `SourceEntry` IN (136330);
INSERT INTO `conditions` (`SourceTypeOrReferenceId`, `SourceGroup`, `SourceEntry`, `ElseGroup`, `ConditionTypeOrReference`, `ConditionTarget`, `ConditionValue1`, `ConditionValue2`, `Comment`) VALUES
('13', '1', '136330', '0', '31', '0',  '3', '68480', 'Iron Qon - Burning Cinders');


DELETE FROM `creature_text` WHERE `entry`=68078;
INSERT INTO `creature_text` (`entry`,`groupid`,`id`,`text`,`type`,`language`,`probability`,`emote`,`duration`,`sound`,`comment`) VALUES
(68078, 0, 0, 'How can this be?!', 14, 0, 100, 0, 0, 35462, 'Iron Qon - mount death 1'),
(68078, 1, 0, 'Gaaaahh!', 14, 0, 100, 0, 0, 35463, 'Iron Qon - mount death 2'),
(68078, 2, 0, 'USELESS!', 14, 0, 100, 0, 0, 35464, 'Iron Qon - mount death 3'),
(68078, 3, 0, 'Stare into the face of true power!', 14, 0, 100, 0, 0, 35465, 'Iron Qon - aggro'),
(68078, 4, 0, 'Dam\'ren! Freeze them to oblivion!', 14, 0, 100, 0, 0, 35466, 'Iron Qon - damren'),
(68078, 5, 0, 'Quet\'zal! Unleash the storm upon my enemies!', 14, 0, 100, 0, 0, 35467, 'Iron Qon - quetzak'),
(68078, 6, 0, 'Ro\'shak! Grant me wings of flame!', 14, 0, 100, 0, 0, 35468, 'Iron Qon - roshak'),
(68078, 7, 0, 'More... training...', 14, 0, 100, 0, 0, 35469, 'Iron Qon - death'),
(68078, 8, 0, '', 14, 0, 100, 0, 0, 35470, 'Iron Qon - intro 1'),
(68078, 9, 0, '', 14, 0, 100, 0, 0, 35471, 'Iron Qon - intro 2'),
(68078, 10, 0, 'I run you through!', 14, 0, 100, 0, 0, 35472, 'Iron Qon - kill 1'),
(68078, 10, 1, 'Fall at my feet!', 14, 0, 100, 0, 0, 35473, 'Iron Qon - kill 2'),
(68078, 11, 0, 'Strike quickly, Manchu! Show them no mercy!', 14, 0, 100, 0, 0, 35474, 'Iron Qon - manchu aggro'),
(68078, 12, 0, 'All brawn, no brains. A recoverable loss.', 14, 0, 100, 0, 0, 35475, 'Iron Qon - minion kill 1'),
(68078, 13, 0, 'He fought with honor... his first and last mistake.', 14, 0, 100, 0, 0, 35476, 'Iron Qon - minion kill 2'),
(68078, 14, 0, 'ARGH! Worthless mongrels! I will kill you myself!', 14, 0, 100, 0, 0, 35477, 'Iron Qon - phase 2'),
(68078, 15, 0, 'What a pathetic display.', 14, 0, 100, 0, 0, 35478, 'Iron Qon - reset'),
(68078, 16, 0, 'Focus, Weisheng! Show your enemy the meaning of pain!', 14, 0, 100, 0, 0, 35479, 'Iron Qon - weisheng aggro');

DELETE FROM `locales_creature_text` WHERE `entry`=68078;
INSERT INTO `locales_creature_text` (`entry`,`textGroup`,`id`,`text_loc8`) VALUES
(68078, 0, 0, 'Как это возможно?!'),
(68078, 1, 0, 'Грррррр!'),
(68078, 2, 0, 'Ничтожества!'),
(68078, 3, 0, 'Взгляните в лицо истинной мощи!'),
(68078, 4, 0, 'Дам\'рен, заморозь их до смерти!'),
(68078, 5, 0, 'Кет\'заль, обрушь на них силу бури!'),
(68078, 6, 0, 'Ро\'шак, дай мне огненные крылья!'),
(68078, 7, 0, 'Больше... тренировок...'),
(68078, 8, 0, 'Уходите, чужаки! Перед вами армия Кона Железного!'),
(68078, 9, 0, 'Достаточно! Давайте, слабаки, вы заслужили награду! Можете сразиться с Коном Железным!'),
(68078, 10, 0, 'Получи!'),
(68078, 10, 1, 'Падите предо мной!'),
(68078, 11, 0, 'Бей быстро, Манчу! Никого не жалей!'),
(68078, 12, 0, 'Ха, сила есть, мозгов нет. Не велика потеря.'),
(68078, 13, 0, 'Он сражался с честью... грубейшая ошибка.'),
(68078, 14, 0, 'Ничтожные полукровки! Я сам вас убью!'),
(68078, 15, 0, 'Ха, жалкое зрелище.'),
(68078, 16, 0, 'Сосредоточься, Вэйшэн! Покажи нашим врагам, что значит боль!');

