DELETE FROM `spell_loot_template` WHERE `entry`=142901;
INSERT INTO `spell_loot_template` VALUES 
('142901', '1', '100', '1', '0', '-142901' , '1'); -- Полный героический сундук с сокровищами

DELETE FROM `spell_loot_template` WHERE `entry`=142397;
INSERT INTO `spell_loot_template` VALUES 
('142397', '1', '5', '1', '0', '-142901' , '1'); -- Героический сундук с сокровищами

DELETE FROM `reference_loot_template` WHERE `Entry`=142901;
INSERT INTO `reference_loot_template` VALUES 
('142901', '98325', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский жезл
('142901', '98324', '0', '1', '1', '1' , '1'), -- Безупречная пандаренская лоза
('142901', '98323', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский щит защитника
('142901', '98322', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский щит
('142901', '98321', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский чародейский клинок
('142901', '98320', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский чародейский жезл
('142901', '98319', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский посох
('142901', '98318', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский топор
('142901', '98317', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский кастет
('142901', '98316', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский меч
('142901', '98315', '0', '1', '1', '1' , '1'), -- Безупречное пандаренское копье
('142901', '98314', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский широкий топор
('142901', '98313', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский молот
('142901', '98312', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский большой меч
('142901', '98280', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский кастет
('142901', '98279', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский топор
('142901', '98278', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский топор
('142901', '98277', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский кастет
('142901', '98276', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский скипетр
('142901', '98275', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский кинжал
('142901', '98274', '0', '1', '1', '1' , '1'), -- Безупречная пандаренская палица
('142901', '98273', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский меч
('142901', '98272', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский меч
('142901', '98271', '0', '1', '1', '1' , '1'), -- Безупречная пандаренская палица
('142901', '98270', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский чародейский клинок
('142901', '98269', '0', '1', '1', '1' , '1'), -- Безупречное пандаренское ружье
('142901', '98268', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский чародейский жезл
('142901', '98267', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский арбалет
('142901', '98266', '0', '1', '1', '1' , '1'), -- Безупречное пандаренское копье
('142901', '98265', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский широкий топор
('142901', '98264', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский посох
('142901', '98263', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский молот
('142901', '98262', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский большой меч
('142901', '98261', '0', '1', '1', '1' , '1'), -- Безупречный пандаренский посох
('142901', '98260', '0', '1', '1', '1' , '1'), -- Безупречное пандаренское копье
('142901', '98258', '0', '1', '1', '1' , '1'), -- Печать громовой крепости
('142901', '98257', '0', '1', '1', '1' , '1'), -- Тяжелые наручи громовой крепости
('142901', '98256', '0', '1', '1', '1' , '1'), -- Ремень громовой крепости
('142901', '98255', '0', '1', '1', '1' , '1'), -- Наплечье громовой крепости
('142901', '98254', '0', '1', '1', '1' , '1'), -- Ножные латы громовой крепости
('142901', '98253', '0', '1', '1', '1' , '1'), -- Шлем громовой крепости
('142901', '98252', '0', '1', '1', '1' , '1'), -- Рукавицы громовой крепости
('142901', '98251', '0', '1', '1', '1' , '1'), -- Башмаки громовой крепости
('142901', '98250', '0', '1', '1', '1' , '1'), -- Кираса громовой крепости
('142901', '98249', '0', '1', '1', '1' , '1'), -- Ожерелье громовой крепости
('142901', '98248', '0', '1', '1', '1' , '1'), -- Пелерина громовой крепости
('142901', '98247', '0', '1', '1', '1' , '1'), -- Печать отметающего сомнения
('142901', '98246', '0', '1', '1', '1' , '1'), -- Тяжелые наручи отметающего сомнения
('142901', '98245', '0', '1', '1', '1' , '1'), -- Ремень отметающего сомнения
('142901', '98244', '0', '1', '1', '1' , '1'), -- Наплечье отметающего сомнения
('142901', '98243', '0', '1', '1', '1' , '1'), -- Ножные латы отметающего сомнения
('142901', '98242', '0', '1', '1', '1' , '1'), -- Шлем отметающего сомнения
('142901', '98241', '0', '1', '1', '1' , '1'), -- Рукавицы отметающего сомнения
('142901', '98240', '0', '1', '1', '1' , '1'), -- Башмаки отметающего сомнения
('142901', '98239', '0', '1', '1', '1' , '1'), -- Кираса отметающего сомнения
('142901', '98238', '0', '1', '1', '1' , '1'), -- Ожерелье отметающего сомнения
('142901', '98237', '0', '1', '1', '1' , '1'), -- Пелерина отметающего сомнения
('142901', '98236', '0', '1', '1', '1' , '1'), -- Перстень-печатка столичного жителя
('142901', '98235', '0', '1', '1', '1' , '1'), -- Ожерелье столичного жителя
('142901', '98234', '0', '1', '1', '1' , '1'), -- Напульсники столичного жителя
('142901', '98233', '0', '1', '1', '1' , '1'), -- Шнурованный ремень столичного жителя
('142901', '98232', '0', '1', '1', '1' , '1'), -- Наплечные пластины столичного жителя
('142901', '98231', '0', '1', '1', '1' , '1'), -- Поножи столичного жителя
('142901', '98230', '0', '1', '1', '1' , '1'), -- Клобук столичного жителя
('142901', '98229', '0', '1', '1', '1' , '1'), -- Повязки столичного жителя
('142901', '98228', '0', '1', '1', '1' , '1'), -- Сандалии столичного жителя
('142901', '98227', '0', '1', '1', '1' , '1'), -- Одеяние столичного жителя
('142901', '98226', '0', '1', '1', '1' , '1'), -- Плащ столичного жителя
('142901', '98225', '0', '1', '1', '1' , '1'), -- Тяжелые наручи столпа молнии
('142901', '98224', '0', '1', '1', '1' , '1'), -- Ремень столпа молнии
('142901', '98223', '0', '1', '1', '1' , '1'), -- Наплечье столпа молнии
('142901', '98222', '0', '1', '1', '1' , '1'), -- Ножные латы столпа молнии
('142901', '98221', '0', '1', '1', '1' , '1'), -- Шлем столпа молнии
('142901', '98220', '0', '1', '1', '1' , '1'), -- Рукавицы столпа молнии
('142901', '98219', '0', '1', '1', '1' , '1'), -- Башмаки столпа молнии
('142901', '98218', '0', '1', '1', '1' , '1'), -- Кираса столпа молнии
('142901', '98217', '0', '1', '1', '1' , '1'), -- Наручи горного пехотинца
('142901', '98216', '0', '1', '1', '1' , '1'), -- Пояс горного пехотинца
('142901', '98215', '0', '1', '1', '1' , '1'), -- Наплеч горного пехотинца
('142901', '98214', '0', '1', '1', '1' , '1'), -- Набедренники горного пехотинца
('142901', '98213', '0', '1', '1', '1' , '1'), -- Шлем горного пехотинца
('142901', '98212', '0', '1', '1', '1' , '1'), -- Рукавицы горного пехотинца
('142901', '98211', '0', '1', '1', '1' , '1'), -- Наголенники горного пехотинца
('142901', '98210', '0', '1', '1', '1' , '1'), -- Жилет горного стрелка
('142901', '98209', '0', '1', '1', '1' , '1'), -- Наручники кипящего хмеля
('142901', '98208', '0', '1', '1', '1' , '1'), -- Боевой пояс кипящего хмеля
('142901', '98207', '0', '1', '1', '1' , '1'), -- Наплечники кипящего хмеля
('142901', '98206', '0', '1', '1', '1' , '1'), -- Брюки кипящего хмеля
('142901', '98205', '0', '1', '1', '1' , '1'), -- Капюшон кипящего хмеля
('142901', '98204', '0', '1', '1', '1' , '1'), -- Перчатки кипящего хмеля
('142901', '98203', '0', '1', '1', '1' , '1'), -- Сапоги кипящего хмеля
('142901', '98202', '0', '1', '1', '1' , '1'), -- Жакет кипящего хмеля
('142901', '98201', '0', '1', '1', '1' , '1'), -- Кольцо ловца ша
('142901', '98200', '0', '1', '1', '1' , '1'), -- Ошейник ловца ша
('142901', '98199', '0', '1', '1', '1' , '1'), -- Напульсники провидца цзинь-юй
('142901', '98198', '0', '1', '1', '1' , '1'), -- Шнурованный ремень провидца цзинь-юй
('142901', '98197', '0', '1', '1', '1' , '1'), -- Наплечные пластины провидца цзинь-юй
('142901', '98196', '0', '1', '1', '1' , '1'), -- Поножи провидца цзинь-юй
('142901', '98195', '0', '1', '1', '1' , '1'), -- Клобук провидца цзинь-юй
('142901', '98194', '0', '1', '1', '1' , '1'), -- Повязки провидца цзинь-юй
('142901', '98193', '0', '1', '1', '1' , '1'), -- Сандалии провидца цзинь-юй
('142901', '98192', '0', '1', '1', '1' , '1'), -- Одеяние провидца цзинь-юй
('142901', '98191', '0', '1', '1', '1' , '1'), -- Плащ ловца ша
('142901', '98190', '0', '1', '1', '1' , '1'), -- Кольцо рассекателя туманов
('142901', '98189', '0', '1', '1', '1' , '1'), -- Колье рассекателя туманов
('142901', '98188', '0', '1', '1', '1' , '1'), -- Наручи бесконечного заряда
('142901', '98187', '0', '1', '1', '1' , '1'), -- Пояс бесконечного заряда
('142901', '98186', '0', '1', '1', '1' , '1'), -- Наплеч бесконечного заряда
('142901', '98185', '0', '1', '1', '1' , '1'), -- Набедренники бесконечного заряда
('142901', '98184', '0', '1', '1', '1' , '1'), -- Шлем бесконечного заряда
('142901', '98183', '0', '1', '1', '1' , '1'), -- Рукавицы бесконечного заряда
('142901', '98182', '0', '1', '1', '1' , '1'), -- Наголенники бесконечного заряда
('142901', '98181', '0', '1', '1', '1' , '1'), -- Жилет бесконечного заряда
('142901', '98180', '0', '1', '1', '1' , '1'), -- Наручники волнореза
('142901', '98179', '0', '1', '1', '1' , '1'), -- Боевой пояс волнореза
('142901', '98178', '0', '1', '1', '1' , '1'), -- Наплечники волнореза
('142901', '98177', '0', '1', '1', '1' , '1'), -- Брюки волнореза
('142901', '98176', '0', '1', '1', '1' , '1'), -- Капюшон волнореза
('142901', '98175', '0', '1', '1', '1' , '1'), -- Перчатки волнореза
('142901', '98174', '0', '1', '1', '1' , '1'), -- Сапоги волнореза
('142901', '98173', '0', '1', '1', '1' , '1'), -- Жакет волнореза
('142901', '98172', '0', '1', '1', '1' , '1'); -- Плащ рассекателя туманов